results/factorial/plaintext-requested-full-broker5/plaintext-requested-full-factorial-b5-rf3-isr3-msg1024-tps1000-batch65536-acks1-prod6-complz4-trial1/producer-perf-6.log
producer_index=6
producer_count=6
producer_records=16666
producer_throughput=166
830 records sent, 165.7 records/sec (0.16 MB/sec), 276.4 ms avg latency, 3627.0 ms max latency.
834 records sent, 166.5 records/sec (0.16 MB/sec), 9.9 ms avg latency, 44.0 ms max latency.
830 records sent, 165.9 records/sec (0.16 MB/sec), 7.8 ms avg latency, 18.0 ms max latency.
833 records sent, 166.3 records/sec (0.16 MB/sec), 7.8 ms avg latency, 14.0 ms max latency.
830 records sent, 166.0 records/sec (0.16 MB/sec), 7.4 ms avg latency, 16.0 ms max latency.
831 records sent, 166.1 records/sec (0.16 MB/sec), 7.3 ms avg latency, 13.0 ms max latency.
831 records sent, 166.1 records/sec (0.16 MB/sec), 7.1 ms avg latency, 12.0 ms max latency.
831 records sent, 166.0 records/sec (0.16 MB/sec), 6.3 ms avg latency, 11.0 ms max latency.
830 records sent, 165.9 records/sec (0.16 MB/sec), 6.3 ms avg latency, 10.0 ms max latency.
831 records sent, 166.1 records/sec (0.16 MB/sec), 6.4 ms avg latency, 11.0 ms max latency.
831 records sent, 166.1 records/sec (0.16 MB/sec), 6.4 ms avg latency, 16.0 ms max latency.
831 records sent, 166.0 records/sec (0.16 MB/sec), 6.4 ms avg latency, 19.0 ms max latency.
831 records sent, 166.1 records/sec (0.16 MB/sec), 6.3 ms avg latency, 22.0 ms max latency.
831 records sent, 166.2 records/sec (0.16 MB/sec), 6.2 ms avg latency, 11.0 ms max latency.
830 records sent, 166.0 records/sec (0.16 MB/sec), 6.3 ms avg latency, 15.0 ms max latency.
831 records sent, 166.0 records/sec (0.16 MB/sec), 6.3 ms avg latency, 19.0 ms max latency.
831 records sent, 166.1 records/sec (0.16 MB/sec), 6.3 ms avg latency, 21.0 ms max latency.
831 records sent, 166.0 records/sec (0.16 MB/sec), 6.2 ms avg latency, 13.0 ms max latency.
831 records sent, 165.7 records/sec (0.16 MB/sec), 6.5 ms avg latency, 21.0 ms max latency.
832 records sent, 166.2 records/sec (0.16 MB/sec), 6.1 ms avg latency, 17.0 ms max latency.
16666 records sent, 165.954693 records/sec (0.16 MB/sec), 20.23 ms avg latency, 3627.00 ms max latency, 6 ms 50th, 17 ms 95th, 398 ms 99th, 465 ms 99.9th.